fonecmid-diplom/src/Documents/НачислениеФиксированнойПремии/НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеФиксированнойПремии</name>
  <registerRecords>CalculationRegister.Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ДополнительныеНачисления</registerRecords>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ДополнительныеНачисления/ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/Удержания/Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Удержания</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Удержания</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВзаиморасчетыССотрудниками/ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/НачислениеФиксированнойПремии/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	НачПериода = НачалоМесяца(Дата);
	КонПериода = КонецМесяца(Дата);
	
	ВидПремия = ПланыВидовРасчета.ДополнительныеНачисления.НайтиПоКоду("ПРЕМ");
	ВидНДФЛ = ПланыВидовРасчета.Удержания.НайтиПоКоду("НЛГ");
	
	Если ВидПремия = Неопределено Тогда
		Отказ = Истина;
		Сообщить("Вид расчета 'ФиксированнаяПремия' не найден");
		Возврат;
	КонецЕсли;
	
	Если ВидНДФЛ = Неопределено Тогда
		Отказ = Истина;
		Сообщить("Вид расчета 'НДФЛ' не найден");
		Возврат;
	КонецЕсли;
	
	Движения.ДополнительныеНачисления.Записывать = Истина;
	Движения.Удержания.Записывать = Истина;
	Движения.ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Для Каждого Строка Из СписокСотрудников Цикл
		
		Сотрудник = Строка.Сотрудник;
		СуммаПремии = Строка.СуммаПремии;
		
		НДФЛ = Окр(СуммаПремии * 13 / 100, 2);
		КВыплате = СуммаПремии - НДФЛ;
		
		Если СуммаПремии > 0 Тогда
			Движение = Движения.ДополнительныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ПериодРегистрации = Дата;
			Движение.ПериодДействияНачало = НачПериода;
			Движение.ПериодДействияКонец = КонПериода;
			Движение.Сотрудник = Сотрудник;
			Движение.Сумма = СуммаПремии;
			Движение.ВидРасчета = ВидПремия;
		КонецЕсли;
		
		Если НДФЛ > 0 Тогда
			ДвижениеУдерж = Движения.Удержания.Добавить();
			ДвижениеУдерж.Сторно = Ложь;
			ДвижениеУдерж.ПериодРегистрации = Дата;
			ДвижениеУдерж.ПериодДействияНачало = НачПериода;
			ДвижениеУдерж.ПериодДействияКонец = КонПериода;
			ДвижениеУдерж.Сотрудник = Сотрудник;
			ДвижениеУдерж.Сумма = НДФЛ;
			ДвижениеУдерж.ВидРасчета = ВидНДФЛ;
		КонецЕсли;
		
		Если КВыплате <> 0 Тогда
			ДвижениеВР = Движения.ВзаиморасчетыССотрудниками.Добавить();
			ДвижениеВР.ВидДвижения = ВидДвиженияНакопления.Приход;
			ДвижениеВР.Период = Дата;
			ДвижениеВР.Сотрудник = Сотрудник;
			ДвижениеВР.Сумма = КВыплате;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
